[
    {
      "id": 1,
      "image": "https://gopsusports.com/imgproxy/--tzem44ilZxFZ08PB2jFltSez0CNauot9bHco5Fsl8/rs:fit:1980:0:0/g:ce/q:90/aHR0cHM6Ly9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2dvcHN1c3BvcnRzLXByb2QvMjAyNC8xMS8yMC80Mk16R25zb1NXT2tqQmszRDFYeGRPdDhIdHZpTXFXUDVqOTJ3U2pFLnBuZw.png",
      "date": "NOVEMBER 20, 2024",
      "title": "FORMER MEN'S SOCCER ALL-AMERICAN RICHARD “DICK” PACKER PASSES AWAY",
      "text": " Former two-time all American and member of the 1956 US Soccer Olympic team, Richard “Dick” Packer passed away Friday evening at the age of 90. Packer was a forward for the Nittany Lions from 1953-55.\n Packer, who graduated in 1956, was a key part, if not the reason for Penn State's 1954 and 1955 national championship runs. He led the program to a combined 17-0-0 record and the team outscored its opponents 91-22 under his play. \nHis offensive records at Penn State are ones that may never be touched. In the team's nine game season in 1955, Packer totaled 24 goals and 50 points, the most goals and points in a single season by a Nittany Lion. Both records still sit atop the Penn State record books. The closest any PSU player has ever come to his point total was Corey Hertzog in 2010, when he tallied 46 points in 25 games."
    },

    {
        "id": 2,
        "image": "https://d2o2figo6ddd0g.cloudfront.net/d/2/na9ka0rwcdm9v7/GT8A2360.JPG",
        "date": "November 8, 2024",
        "title": "#2 Behrend Men's Soccer Plays #1 Alfred State for AMCC Title",
        "text": "* The Lions earned a 2-1 overtime win over No. 3 Mount Aloysius on Wednesday in the AMCC Semifinals to advance to the title game\n * The Mounties tallied the first score of the game in the 66th minute to take a 1-0 lead\n * Senior Blake Cooper (Murrysville, PA/Franklin Regional) knotted the score at one apiece with a score in the 83rd minute to force extra time\n * Fellow senior Johnathan Swann (Allison Park, PA/North Allegheny) delivered a bicycle kick for the game-winner and his third goal of the season which came with five minutes remaining in overtime"
      },

      {
        "id": 3,
        "image": "https://d2o2figo6ddd0g.cloudfront.net/1/x/5kxtxv2cax26z5/GT8A2065.JPG",
        "date": "October 29, 2024",
        "title": "Lions Rout Hilbert In Regular Season Finale; Named Co-Regular Season Champions",
        "text": "The Penn State Behrend men's soccer team earned Allegheny Mountain Collegiate Conference (AMCC) Co-Regular Season Champions with Alfred State after defeating Hilbert, 6-0, in the regular season finale on Tuesday night."
      },

      {
        "id": 4,
        "image": "https://cdn.prestosports.com/action/cdn/img/mw=1920/cr=n/d=lh9eo/rog0dq889t3clarp.jpg",
        "date": "September 5, 2024",
        "title": "Three Second-Half Goals Send Brandywine To First Conference Victory",
        "text": "Penn State Brandywine netted three goals during the final 45 minutes and scored its first-ever United East Conference men's soccer victory, defeating Gallaudet 3-1, late Wednesday night.\n The Lions dominated possession of the ball, accumulating 29 shots, 12 of which were on target, and attempted all eight of the match's corner kicks. Elijah DeBooth (West Lawn, Pa./Wilson) played all 90 minutes in net, needing just one save to earn his fourth win of the season."
      },
  
    {
      "id": 5,
      "image": "https://d2o2figo6ddd0g.cloudfront.net/5/f/ywhdhxad54bhal/DSC_0008.jpg",
      "date": "September 5, 2024",
      "title": "Quarterfinals Draw Announced",
      "text": "On Thursday afternoon, the visiting Penn State Scranton Lions men's soccer team lost their 2024 season debut by a 3-0 margin to non-conference foe the Bucks County Community College Centurions."
    },

    {
        "id": 6,
        "image": "https://cdn.prestosports.com/action/cdn/img/mw=1920/cr=n/d=j3nwb/8slk77bhlapxefdg.jpg",
        "date": "Aug 31, 2024",
        "title": "Brandywine Rallies To Force Season-Opening Draw",
        "text": " Christian Zavala (Kennett Square, Pa./Kennett) scored during the 79th minute to knot the score as the Penn State Brandywine men's soccer team earned a 2-2 draw at former conference mate Penn State Lehigh Valley to begin the 2024 season on Saturday afternoon."
      }

  ]
  